---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
TaskDialogShowingEventArgs Properties
TaskDialogShowingEventArgs Class See Also Send Feedback
---

The TaskDialogShowingEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.  (Inherited from DialogBoxShowingEventArgs.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | Message | The message that has been displayed in the dialog box. |

# See Also

TaskDialogShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace